
## Plan Result (prod_twingate)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 4 to add, 2 to change, 3 to destroy.</code></pre>

* Create
  * time_rotating.service_account_key_rotation
* Update
  * azurerm_key_vault_secret.service_account_key[&#34;AzureDevOps&#34;]
  * azurerm_key_vault_secret.service_account_key[&#34;Pterodactyl&#34;]
* Replace
  * time_static.service_account_key_rotation


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.service_account_key["AzureDevOps"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "service_account_key" {
      ~ expiration_date         = "2024-11-08T21:02:10Z" -> (known after apply)
        id                      = "https://bancey-vault.vault.azure.net/secrets/Twingate-AzureDevOps-SA-Key/bc538e7bba7d483683d67782bc351218"
        name                    = "Twingate-AzureDevOps-SA-Key"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.service_account_key["Pterodactyl"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "service_account_key" {
      ~ expiration_date         = "2024-11-08T21:02:10Z" -> (known after apply)
        id                      = "https://bancey-vault.vault.azure.net/secrets/Twingate-Pterodactyl-SA-Key/8979acfc06a54a6683b30cf71d0cd780"
        name                    = "Twingate-Pterodactyl-SA-Key"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (6 unchanged attributes hidden)
    }

  # time_rotating.service_account_key_rotation will be created
  + resource "time_rotating" "service_account_key_rotation" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 7
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

  # time_static.service_account_key_rotation must be replaced
-/+ resource "time_static" "service_account_key_rotation" {
      ~ day     = 8 -> (known after apply)
      ~ hour    = 21 -> (known after apply)
      ~ id      = "2024-11-08T21:02:10Z" -> (known after apply)
      ~ minute  = 2 -> (known after apply)
      ~ month   = 11 -> (known after apply)
      ~ rfc3339 = "2024-11-08T21:02:10Z" -> (known after apply) # forces replacement
      ~ second  = 10 -> (known after apply)
      ~ unix    = 1731099730 -> (known after apply)
      ~ year    = 2024 -> (known after apply)
    }

  # twingate_service_account_key.this["AzureDevOps"] will be replaced due to changes in replace_triggered_by
-/+ resource "twingate_service_account_key" "this" {
      ~ id                 = "U2VydmljZUFjY291bnRLZXk6dE91eWFBMUo0VXotcVlkaDZBV1ZuX3R1WWI4TGhYVDYzNGk2WUE0Wlh6MA==" -> (known after apply)
      ~ is_active          = true -> (known after apply)
        name               = "AzureDevOps Key (auto rotates)"
      ~ token              = (sensitive value)
        # (2 unchanged attributes hidden)
    }

  # twingate_service_account_key.this["Pterodactyl"] will be replaced due to changes in replace_triggered_by
-/+ resource "twingate_service_account_key" "this" {
      ~ id                 = "U2VydmljZUFjY291bnRLZXk6OTFKYWJ4djhWSWEzQTl3WjFsdjZoUXJsQTF4UzFZTlVJcDM2d2M1ZFY3VQ==" -> (known after apply)
      ~ is_active          = true -> (known after apply)
        name               = "Pterodactyl Key (auto rotates)"
      ~ token              = (sensitive value)
        # (2 unchanged attributes hidden)
    }

Plan: 4 to add, 2 to change, 3 to destroy.
```

</details>


<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # time_rotating.service_account_key_rotation has been deleted
  - resource "time_rotating" "service_account_key_rotation" {
        id               = "2024-11-08T21:02:10Z"
      - rfc3339          = "2024-11-08T21:02:10Z" -> null
        # (9 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":378,"Program":"tfcmt","SHA1":"","Target":"prod_twingate","Vars":{}} -->